# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'AdoptOpenJDK/openjdk'

# Base tools
brew 'ack'                                          # https://beyondgrep.com/
brew 'bash'                                         # https://www.gnu.org/software/bash/
brew 'coreutils'                                    # Those that come with macOS are outdated
brew 'dos2unix'                                     # https://waterlan.home.xs4all.nl/dos2unix.html
brew 'fasd'                                         # https://github.com/clvv/fasd
brew 'findutils'                                    # https://www.gnu.org/software/findutils/
brew 'fd'                                           # https://github.com/sharkdp/fd
brew 'fontconfig'                                   # https://wiki.freedesktop.org/www/Software/fontconfig/
brew 'fzf'                                          # https://github.com/junegunn/fzf
brew 'gawk'                                         # https://www.gnu.org/software/gawk/
brew 'git'                                          # https://git-scm.com/
brew 'gnupg'                                        # https://www.gnupg.org/
brew 'gnu-sed', args: ['with-default-names']        # https://www.gnu.org/software/sed/
brew 'gradle'                                       # https://gradle.org/
brew 'grep'                                         # https://www.gnu.org/software/grep/
#brew 'lnav'                                         # http://lnav.org/
brew 'mackup'                                       # https://github.com/lra/mackup
brew 'mas'                                          # https://github.com/mas-cli/mas
brew 'moreutils'                                    # https://joeyh.name/code/moreutils/
#brew 'ncdu'                                         # https://dev.yorhel.nl/ncdu
brew 'nmap'                                         # https://nmap.org/
brew 'openconnect'                                  # http://www.infradead.org/openconnect/
brew 'peco'                                         # https://github.com/peco/peco
#brew 'ranger'                                       # https://github.com/ranger/ranger
brew 'readline'                                     # https://tiswww.case.edu/php/chet/readline/rltop.html
brew 'ripgrep'                                      # https://github.com/BurntSushi/ripgrep
brew 'screen'                                       # https://www.gnu.org/software/screen/
brew 'sift'                                         # https://sift-tool.org/
brew 'the_silver_searcher'                          # https://github.com/ggreer/the_silver_searcher
brew 'tig'                                          # https://jonas.github.io/tig/
brew 'tmux'                                         # https://github.com/tmux/tmux
brew 'trash'                                        # https://hasseg.org/trash/
brew 'tree'                                         # http://mama.indstate.edu/users/ice/tree/
brew 'ttyrec'                                       # http://0xcc.net/ttyrec/
brew 'vim', args: ['with-override-system-vi']       # https://www.vim.org/
brew 'watchman'                                     # https://facebook.github.io/watchman/
brew 'wget', args: ['enable-iri']                   # https://www.gnu.org/software/wget/
brew 'yank'                                         # https://github.com/mptre/yank
brew 'zsh'                                          # https://www.zsh.org/
brew 'zplug'                                        # https://github.com/zplug/zplug

# Developer tools
brew 'adoptopenjdk-openjdk8'                        # https://adoptopenjdk.net/
brew 'ansible'                                      # https://github.com/ansible/ansible
brew 'awscli'                                       # https://github.com/aws/aws-cli
brew 'httpie'                                       # https://httpie.org/
brew 'jq'                                           # https://stedolan.github.io/jq/
brew 'nvm'                                          # https://github.com/creationix/nvm
brew 'packer'                                       # https://www.packer.io/
brew 'postgresql'                                   # https://www.postgresql.org/
#brew 'python'                                       # https://docs.brew.sh/Homebrew-and-Python
brew 'pyenv'                                        # https://github.com/pyenv/pyenv
brew 'pyenv-virtualenv'                             # https://github.com/pyenv/pyenv-virtualenv
brew 'pyenv-virtualenvwrapper'                      # https://github.com/pyenv/pyenv-virtualenvwrapper
brew 'terraform'                                    # https://www.terraform.io/
brew 'terragrunt'                                   # https://github.com/gruntwork-io/terragrunt

# Apps
cask 'aerial'                                       # https://github.com/JohnCoates/Aerial
cask 'alfred'                                       # https://www.alfredapp.com/
cask 'caffeine'                                     # http://lightheadsw.com/caffeine/
cask 'dbeaver-community'                            # https://github.com/dbeaver/dbeaver
cask 'docker'                                       # https://www.docker.com/
cask 'dropbox'
cask 'dynamodb-local'                               # https://docs.aws.amazon.com/amazondynamodb/latest/developerguide/DynamoDBLocal.html
cask 'firefox'                                      # https://www.mozilla.org/en-US/firefox/
cask 'gitup'                                        # http://gitup.co/
cask 'google-backup-and-sync'                       # https://www.google.com/drive/download/backup-and-sync/
#cask 'google-chrome'                                # https://www.google.com/chrome/
cask 'gpg-suite'                                    # https://gpgtools.org/
cask 'grammarly'                                    # https://www.grammarly.com/
cask 'insomnia'                                     # https://insomnia.rest/
cask 'iterm2'                                       # https://www.iterm2.com/
cask 'java'                                         # https://www.java.com/en/download/faq/develop.xml
#cask 'little-snitch'                                # https://www.obdev.at/products/littlesnitch/index.html
#cask 'micro-snitch'                                 # https://www.obdev.at/products/microsnitch/index.html
cask 'macvim'                                       # https://github.com/macvim-dev/macvim
#cask 'mysqlworkbench'                               # https://www.mysql.com/products/workbench/
cask 'nvalt'                                        # http://brettterpstra.com/projects/nvalt/
cask 'postman'                                      # https://www.getpostman.com/
#cask 'shuttle'                                      # https://fitztrev.github.io/shuttle/
cask 'sizeup'                                       # https://www.irradiatedsoftware.com/sizeup/
cask 'slack'                                        # https://slack.com/
#cask 'spectacle'                                    # https://www.spectacleapp.com/
cask 'vagrant'                                      # https://www.vagrantup.com/
cask 'virtualbox'                                   # https://www.virtualbox.org/
cask 'virtualbox-extension-pack'                    # https://en.wikipedia.org/wiki/VirtualBox#VirtualBox_Extension_Pack
cask 'visual-studio-code'                           # https://code.visualstudio.com/
cask 'vlc'                                          # https://www.videolan.org/vlc/index.html

# Quicklook plugins
cask 'qlcolorcode'                                  # https://github.com/n8gray/QLColorCode
cask 'qlimagesize'                                  # https://github.com/Nyx0uf/qlImageSize
cask 'qlmarkdown'                                   # https://github.com/toland/qlmarkdown
cask 'qlvideo'                                      # https://github.com/Marginal/QLVideo
cask 'qlstephen'                                    # https://whomwah.github.io/qlstephen/
cask 'quicklook-csv'                                # https://github.com/p2/quicklook-csv
cask 'quicklook-json'                               # http://www.sagtau.com/quicklookjson.html
cask 'webpquicklook'                                # https://github.com/emin/WebPQuickLook

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fontawesome'
cask 'font-awesome-terminal-fonts'
cask 'font-hack'
cask 'font-inconsolata-dz-for-powerline'
cask 'font-inconsolata-g-for-powerline'
cask 'font-inconsolata-for-powerline'
cask 'font-roboto-mono'
cask 'font-roboto-mono-for-powerline'


# Mac App Store apps
mas 'LastPass', id: 926036361
mas 'The Unarchiver', id: 425424353
